Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_insurance_prsi/voluntarysocialinsurancecontributions.html.txt.tmx
Source language: en
Languages: ga

source: Voluntary social insurance contributions
ga: Ranníocaíochtaí deonacha árachais shóisialaigh

source: Paying social insurance can help you to qualify for social insurance payments, such as the State Pension (Contributory)
ga: Is féidir le híocadh Árachais shóisialta cuidiú leat bheith i dteideal íocaíochtaí árachais shóisialaigh, ar nós An Pinsean Stáit (Ranníocaíochta)

source: If you are an employee Pay Related Social Insurance (PRSI) deductions are made from your earnings each week
ga: Más fostaí thú, gearrtar asbhaintí Árachas Sóisialach Pá-Choibhneasta (ÁSPC) ó do phá gach aon seachtain

source: If you are no longer an employee or if you are self-employed and you are no longer making compulsory PRSI contributions, you can opt to make voluntary contributions
ga: Mura fostaí tú a thuilleadh nó má tá tú féinfhostaithe agus gan ranníocaíochtaí (ÁSPC) a dhéanamh, thig leat ranníocaíochtaí deonacha a dhéanamh

source: If you are getting a social welfare payment or signing for credits you may get credited contributions which will also keep your social insurance record up to date
ga: Má bhíonn tú ag fáil íocaíocht leasa shóisialaigh, nó ag síniú le haghaidh creidmheasanna, is féidir go bhfuil ranníocaíochtaí creidiúnaithe nó ‘creidmheasanna’ dlite duit, rud a choinneoidh d'árachas sóisialta cothrom le dáta freisin

source: Voluntary contributions can help maintain your social insurance record and help you to qualify for social insurance payments in the future
ga: Is féidir le ranníocaíochtaí deonacha do thaifead árachais shóisialta a chothabháil agus cuidiú leat bheith i dteideal íocaíochtaí árachais shóisialaigh sa todhchaí

source: They cover long-term benefits such as pensions
ga: Cumhdaíonn ranníocaíochtaí deonacha sochair fhadtéarmacha, dála pinsean

source: They do not cover short-term benefits for illness, maternity or jobseekers
ga: Ní chumhdaíonn ranníocaíochtaí deonacha sochair ghearrthéarmacha, áfach, le haghaidh breoiteachta, cuardaitheora post agus máithreachais, mar shampla

source: You can choose to pay voluntary contributions (if you are under 66 and meet the other conditions) if you:
ga: Féadfaidh tú roghnú ranníocaíochtaí deonacha a íoc (má tá tú faoi bhun 66 bliain d'aois agus sásaíonn tú na coinníollacha eile) mura dtá tú:

source: • Are no longer covered by compulsory PRSI in Ireland
ga: • Faoi chumhdach scéim ÁSPC a thuilleadh ar bhonn éigeantach in Éirinn

source: • Are no longer covered by PRSI on a compulsory or voluntary basis in another EU country
ga: • Faoi chumhdach scéim ÁSPC a thuilleadh, ar bhonn éigeantach ná deonach, i dtír ar bith eile de chuid an AE

source: If you are working outside the EU and not subject to Irish or EU social insurance contributions you may also opt to pay voluntary contributions
ga: Má tá tú ag obair thar lear agus níl tú faoi réir ranníocaíochtaí ÁSPC na hÉireann nó an AE féadfaidh tú roghnú ranníocaíochtaí deonacha a íoc

source: If you are taking time off work to care for children under 12 years of age, or a disabled child or adult, the Homemaker’s Scheme may be a better option than making voluntary contributions
ga: Más duine thú a d’éirigh as an obair chun dul i gcúram linbh faoi 12 bliana d’aois nó i gcúram duine éagumasach/ linbh éagumasach thig le Scéim um Chúramaí Baile bheith ina rogha níos fearr duit ná ranníocaíochtaí deonacha a dhéanamh

source: Changes to PRSI requirements for voluntary contributors
ga: Athruithe ar riachtanais ÁSPC do ranníocóirí deonacha

source: From 6 April 2015 you need 520 paid PRSI contributions (10 years) to be eligible to make voluntary contributions:
ga: Ó 6 Aibreán 2015 is gá 520 ranníocaíocht ÁSPC (10 mbliana) a bheith íoctha agat chun bheith incháilithe ranníocaíochtaí deonacha a dhéanamh:

source: • People who became voluntary contributors after 6 April 2014 and before 6 April 2015 needed 468 PRSI paid contributions (9 years)
ga: • Má bhí daoine ina ranníocóir ar 6 Aibreán 2013 go 6 Aibreán 2014, ba ghá dóibh 364 ranníocaíocht ÁSPC a bheith íoctha acu (9 mbliana)

source: • People who became voluntary contributors after 6 April 2013 but before 6 April 2014 needed 364 PRSI paid contributions (7 years)
ga: • Má bhí daoine ina ranníocóir ar 6 Aibreán 2014 go 6 Aibreán 2015, ba ghá dóibh 468 ranníocaíocht ÁSPC a bheith íoctha acu (7 mbliana)

source: To be eligible to make voluntary contributions you must:
ga: Chun cáiliú le ranníocaíochtaí deonacha a dhéanamh ní mór duit:

source: • Have at least 520 PRSI contributions paid under compulsory insurance in either employment or self-employment
ga: • 520 seachtain ar a laghad de ranníocaíochtaí ÁSPC íoctha faoi árachas éigeantach i gceachtar fostaíocht nó féinfhostaíocht

source: • Apply to make your voluntary contribution within 60 months (5 years) of the end of the last completed tax year (contribution year) during which you last paid compulsory insurance or you were last awarded a credited contribution
ga: • Ní mór duit iarratas chun ranníocaíochtaí deonacha a dhéanamh laistigh de 60 mhí i ndiaidh dheireadh na bliana cánach (bliain ranníocaíochta) ar lena linn a d’íoc tú árachas éigeantach nó a bhí ranníocaíochta creidiúnaithe agat

source: (From February 2017, the time limit for making voluntary contributions is extended from 12 months to 60 months.)
ga: (Ó Feabhra 2017, tá an teorainn ama le haghaidh ranníocaíochtaí deonacha méadaithe ó 12 mhí go 60 mhí.)

source: • Agree to pay voluntary contributions from the start of the contribution week that follows the week in which you leave compulsory insurance
ga: • Comhaontú le ranníocaíochtaí deonacha a íoc ó thús seachtain ranníocaíochta a leanann an tseachtain a d’éirigh tú as árachas éigeantach

source: The contribution year is the same as the income tax year so it runs from January to December
ga: Is ionann an bhliain ranníocaíochta agus an bhliain chánach ioncaim, is é sin ó Eanáir go Nollaig

source: You cannot use contributions paid in Class J to satisfy these conditions
ga: Ní féidir ranníocaíochtaí atá íoctha de réir Aicme ÁSPC J a úsáid chun na coinníollacha seo a chomhlíonadh

source: However, you may pay PRSI at Class J and voluntary contributions at the same time
ga: Is féidir leat, áfach, ÁSPC ag Aicme J agus ranníocaíochtaí deonacha a íoc ag an am céanna

source: You stop paying voluntary contributions either when you reach 66 years of age or start paying PRSI again
ga: Stadann tú ag íoc ranníocaíochtaí deonacha ceachtar nuair a bhíonn tú 66 bliana d’aois nó nuair a thosaíonn tú ag íoc ÁSPC arís

source: There are three rates of voluntary contributions
ga: Tá trí ráta éagsúil do ranníocaíochtaí deonacha ann

source: The rate of voluntary contribution you pay is linked to the last PRSI contribution paid or credited by you
ga: Is ionann an ráta ranníocaíocht deonach a íocann tú agus an ranníocaíocht ÁSPC is déanaí a d’íoc tú nó atá creidiúnaithe agat

source: More information is available about paying social insurance
ga: Léigh tuilleadh eolais faoi íocadh árachais shóisialaigh

source: If you paid PRSI at Class A, E or H you pay a high rate contribution of 6.6% of your reckonable income in the previous tax year, subject to a minimum payment of €500
ga: Má d’íoc tú ÁSPC ag Aicme A, E, nó H, íocann tú ardráta ranníocaíochta de 6.6% ar d’ioncam inríofta sa bhliain cánach roimhe sin faoi réir íos-táille de €500

source: The social insurance payments you may be entitled to by making voluntary contributions at this rate are:
ga: Is féidir bheith i dteideal íocaíochtaí árachais shóisialta le ranníocaíochtaí deonacha a íoc ag an ráta seo mar a leanas :

source: • Widow’s, Widower’s or Surviving Civil Partner's (Contributory) Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: If you paid PRSI at Class B, C or D you pay a low rate contribution of 2.6% of your reckonable income in the previous tax year, subject to a minimum payment of €250
ga: Má d’íoc tú ÁSPC ag Aicme B, C, nó D íocann tú íosráta ranníocaíochta de 2.6% ar d’ioncam inríofa sa bhliain chánach roimhe sin faoi réir íostáille de €250

source: If you paid PRSI at Class S you pay a special flat rate of €500
ga: Má d’íoc tú ÁSPC ag Aicme S íocann tú bunráta de €500

source: You can pay voluntary contributions by cheque, banker’s draft or standing order
ga: Is féidir ranníocaíochtaí a íoc le seic, Dréacht Bainc nó Dochar Díreach

source: Your contribution can be paid as a lump sum before the end of the contribution year or by quarterly or half-yearly installments during the contribution year
ga: Is féidir leat do ranníocaíochtaí deonacha a íoc le cnapshuim roimh dheireadh na bliana ranníocaíochta nó le tráthchodanna gach trí nó se mhí le linn na bliana ranníocaíochta

source: You must pay the full contribution for a year no later than 5 months after the end of the year in which the payment is due
ga: Ní mór duit iomlán na ranníocaíochta don bhliain a íoc gan a bheith níos moille ná 5 mhí i ndiaidh dheireadh na bliana ina bhfuil an íocaíocht dlite

source: You can read more about voluntary contributions on the Department of Social Protection's website
ga: Is féidir leat tuilleadh a léamh faoi ranníocaíochtaí deonacha ar láithreán gréasáin na Roinne Coimirce Sóisialaí

source: To become a voluntary contributor you must download and complete application form VC 1 (pdf)
ga: Le bheith i do ranníocóir deonach ní mór duit an fhoirm VC 1 a íoslódáil agus a líonadh (pdf)

source: You can also get this form from your Intreo centre or social welfare local office
ga: Is féidir leat an fhoirm seo a fháil ó Ionad Intreo agus d'oifig áitiúil leasa shóisialaigh
